import random

game_end = False

min_number = 1
max_number = 100
computer_number = random.randint(min_number, max_number)
start_skore = skore = 10

print (""" 
-----------------------------------------------------------------------------
Привіт! Комп'ютор загадал число, спробуйте вгадати! Для виходу з гри ведіть 0
-----------------------------------------------------------------------------
""")

while game_end == False:

    user_number = int(input("Введіть число: "))
    

    if (user_number == 0):
        # Умова виходу з гри, якщо користувач введе на клавіатурі 0 то 
        game_end = True

    elif (user_number != computer_number):
        skore -= random.randint(1, 10)
        
        if (skore <= 0):
            print("Ви програли:(")
            user_number = input("Для того щоб почати з початку натисніть Enter, щоб вийти 0: ")
           
            if user_number == 0:
                # Завершити гру досрочно
                game_end = True

            else:
                skore = start_skore
                print("""-----------------------------------------------------------------------------
                Що ж продовжимо, ваш рахунок - """, skore, """
-----------------------------------------------------------------------------""")

        else:
            print("Упс, ви відповіли неправильно! У вас залишилось", skore, "очок, не здавайтесь")
            print(user_number, computer_number)
    

    else:
#  Цикл перемоги, події відбуваються коли користувач вгадує число
        skore += random.randint(1, 35)
        print("""-----------------------------------------------------------------------------------
        Вітаємо, ви перемогли! 
        Ваш рахунок -""", skore, """
        Зіграємо ще раз?:)
        --------------------------------------------------------------------------------------------""")
        user_number = input("""
        Enter - зіграти ще раз, 0 - вийти
        ********************************************************************************************
         """)
        if user_number == 0:
            game_end = True
        computer_number = random.randint(min_number, max_number)
        







print("""
*************************************************************************
Дякую що зіграли в мою гру! Ваш кінцевий рахунок:""", skore, """ 
Повертайтесь скоріше! будемо чекати вас з нетерпінням
Р.S. Ви добре тиримались:)
*************************************************************************
 """)