import random

game_end = False


min_number = 1
max_number = 100
computer_number = random.randint(min_number, max_number)
start_skore = skore = 100
user_number = 0

print (""" 
-----------------------------------------------------------------------------
Привіт! Комп'ютор загадав число від """, min_number, " до ", max_number, """, спробуйте вгадати! Для виходу з гри ведіть 0
Для того щоб отримати підкаску введіть відємне число, підказка коштує від 1 до 5 балів
-----------------------------------------------------------------------------
""",  sep ='')

while game_end == False:
    
    user_number = int(input("Введіть число: "))



    if (user_number == 0):
        # Умова виходу з гри, якщо користувач введе на клавіатурі 0 то 
        game_end = True

    elif (user_number < 0):
        #Цикл підказки
        print("================================================================")
        tip = random.randint(1, 5)
        
        if tip == 1:
            tip = computer_number % 2
          
            if tip == 0:
                print("Число парне")
            else:
                print("Число не парне")


        
        elif tip == 2:
            tip = computer_number % 3
            if tip == 0:
                print("Число кретне 3")
            else:
                print("Число не кретне 3")

        elif tip == 3:
            if computer_number < 30:
                print("Число що загадав компютор менше 30")
            elif computer_number <= 60:
                print("Число що загадав компютор в діапазоні від 30 до 60 включно")
            else:
                print("Число більше за 60!")


        elif tip == 4:
            tip = random.randint(1, 6)
            false_number1 = random.randint(1,100)
            false_number2 = random.randint(1, 100)
            print("Одне з цих чисел вірне! але яке ж?")

            if tip == 1:
                print(computer_number, false_number1, false_number2)

            elif tip == 2:
                print(false_number1, computer_number, false_number2)

            elif tip == 3:
                print(computer_number, false_number2, false_number1)
            
            elif tip == 4:
                print(false_number1, false_number2, computer_number)

            elif tip == 5:
                print(false_number2, false_number1, computer_number)

            else:
                print(false_number2, computer_number, false_number1)

        else:
            tip = len(str(computer_number))
            if tip == 1:
                print("Число має одну чифру")
            else:
                print("Число має дві цифри")

        skore -= tip
        print("У вас залишилось:", skore, "очок!")
        print("================================================================")

    elif (user_number != computer_number) and user_number <= max_number:
        # Цикл неправильних відповідей
        skore -= random.randint(1, 10)
        
        if (skore <= 0):
            # цикл програшу
            print("""***********************************************************************
            Ви програли:(""")
            user_number = input("""Для того щоб почати з початку натисніть Enter, щоб вийти 0: 
***********************************************************************
""")
           
            if user_number == str(0):
                # Завершити гру після програшу
                game_end = True

            else:
                # Почати гру заново після програшу
                skore = start_skore
                print("""-----------------------------------------------------------------------------
Що ж почнемо з початку, ваш рахунок - """, skore, """
-----------------------------------------------------------------------------""")

        else:
            # Повідомлення при неправильній відповіді
            dif_user_comp = user_number - computer_number
            if dif_user_comp < 0:
                dif_user_comp = dif_user_comp * (-1)
           
            if (dif_user_comp < 6):
                print("""-----------------------------------------------------------------------------------------
Гаряче, ви майже вгадали!""")

            elif (dif_user_comp < 11):
                print("""-----------------------------------------------------------------------------------------
Це було близько, спробуйте ще!""")

            elif (dif_user_comp < 21):
                print("""-----------------------------------------------------------------------------------------
Холодно!""")

            else:
                print("""-----------------------------------------------------------------------------------------
Льодяний вітер""")
            print("У вас залишилось", skore, """очок, не здавайтесь
-----------------------------------------------------------------------------------------""")



    

    elif (user_number == computer_number):
#  Цикл перемоги, події відбуваються коли користувач вгадує число
        skore += random.randint(1, 35)
        print("""-----------------------------------------------------------------------------------
Вітаємо, ви перемогли! 
Ваш рахунок -""", skore, """
Зіграємо ще раз?:)
--------------------------------------------------------------------------------------------""")
        user_number = input("""Enter - зіграти ще раз, 0 - вийти
********************************************************************************************
""")
        if user_number == str(0):
            game_end = True
        computer_number = random.randint(min_number, max_number)


    else:
        # помилка на випадок непередбачених чисел
        print("Ви ввели більше число ніж комп'ютор може загадти")
        








print("""
*************************************************************************
Дякую що зіграли в мою гру! Ваш кінцевий рахунок:""", skore, """ 
Повертайтесь скоріше! будемо чекати вас з нетерпінням
Р.S. Ви добре тиримались:)
*************************************************************************
 """)